[{"id":1,"title":null,"summary":"From the HTML provided, I don't see an actual technology news story with a clear headline, content, or article text. What I can see is a navigation structure of the Spectrum News website, which includes a \"Technology\" section under their \"Latest News\" category, but no specific technology news article content is present in this HTML snippet.\n\nThe HTML appears to be primarily the site's navigation framework, weather alerts, and some promotional content for the Spectrum News app, but lacks a complete news article about technology that could be summarized.","date":null,"source":null,"url":"https://mynews13.com/fl/orlando/news/technology"},{"id":2,"title":null,"summary":"# Student Experiment on Radiation Shielding Technology Selected for ISS Testing\n\nFlorida Tech students have developed a radiation shielding experiment that has been selected for testing aboard the International Space Station. The experiment aims to evaluate new radiation protection technology in the space environment.\n\nThis achievement represents a significant opportunity for the university's research program to contribute to space safety innovations. The selection highlights Florida Tech's continued involvement in advancing space exploration technology and providing students with hands-on research experience in real-world applications.\n\nThe experiment could potentially improve protection systems for astronauts during long-duration space missions, addressing one of the key challenges of human spaceflight.","date":null,"source":null,"url":"https://www.fit.edu/"},{"id":3,"title":null,"summary":"# Full Sail, Epic Games Bring Inaugural Unreal Game Jam to Orlando\n\nFull Sail University has partnered with Epic Games to host the first-ever \"Unreal Fest Game Jam\" in Orlando, marking a significant milestone for Central Florida's technology scene. \n\nThe event brings together game developers to create games using Epic's Unreal Engine technology in a competitive, time-limited format. This collaboration highlights Orlando's growing importance in the gaming industry and provides local developers with an opportunity to showcase their skills using professional-grade game development tools.\n\nThe game jam is part of a broader technology ecosystem in Orlando that includes various gaming initiatives, educational programs, and industry partnerships. Full Sail University, known for its game development and digital arts programs, continues to strengthen its relationship with major industry players like Epic Games, the company behind the popular Fortnite franchise and Unreal Engine.\n\nThis event adds to Orlando's reputation as an emerging technology hub beyond its traditional tourism industry, particularly in gaming, simulation, and digital entertainment sectors.","date":null,"source":null,"url":"https://orlandotechnews.com/"},{"id":4,"title":null,"summary":"# UCF Researchers Develop Robots for Real-World Applications\n\nUCF researchers are making significant strides in robotics technology with practical real-world applications. According to a feature in Pegasus Magazine, the university is developing both smart-assistant robots capable of helping people with daily tasks, such as feeding, and Mars-ready rovers built by UCF's robotics club.\n\nThe robotics initiatives are part of UCF's broader focus on technology and innovation, which includes research in areas like optics, quantum physics, and aerospace. Dr. Peter Delfyett's work on making lasers faster and more efficient, and Jillian Gloria's research on finding water on the moon for future astronaut habitation, demonstrate the university's commitment to advancing technologies that address real-world challenges.\n\nAs part of its dedication to developing minds and machines that will shape the future, UCF is also strengthening its faculty in engineering and computer science to support growing student demand in these fields.","date":null,"source":null,"url":"https://www.ucf.edu/"},{"id":5,"title":null,"summary":"# USF and Florida High Tech Corridor Commit $100,000 to Support Innovation Projects\n\nThe University of South Florida (USF) and the Florida High Tech Corridor have announced a partnership to provide $100,000 in funding for several innovative educational initiatives. The funding will support projects focused on artificial intelligence literacy, bilingual educator training, immersive learning experiences, and social and emotional learning curriculum.\n\nThe partnership highlights the ongoing commitment of both organizations to advance technological innovation in Florida's educational landscape. This collaboration is part of the Florida High Tech Corridor's broader mission of aligning opportunities and resources across academia, industry, and economic development throughout the 23-county region of Central Florida.\n\nThe funding represents a strategic investment in developing the region's high-tech workforce capabilities, which spans from Florida's Suncoast to Space Coast.","date":null,"source":null,"url":"https://floridahightech.com/"},{"id":6,"title":null,"summary":"# Orlando Tech Employment Reaches 74,000, Growing at Second-Fastest Rate Among Major U.S. Regions\n\nOrlando's technology workforce hit 74,000 in 2023, an increase of 2,000 jobs from the previous year and 9,500 more than five years ago, according to new data from CompTIA's annual State of the Tech Workforce report.\n\nThe region's tech employment grew by 2.8% last year, making it the second-fastest growing tech hub among the nation's 30 most populous regions, surpassing tech centers like Austin (2.4%), Miami (2.3%), and Tampa (1.5%). This growth rate was more than double the national average of 1.2%.\n\nOrlando's tech workforce comprises nearly equal numbers of people working for tech companies (46,896) and those in tech occupations (45,641). Software dominates the sector, representing over half of tech industry employment and the largest share of tech occupations at 35.6%.\n\nTech jobs in Orlando command a significant wage premium, with median salaries more than double the region's overall median wage. However, the tech workforce lacks diversity, with women holding only 28% of tech jobs, while Hispanic and Black workers represent just 16% and 11% respectively.\n\nThe region's tech ecosystem received a boost in 2024 with the arrival of Plug and Play, a startup accelerator and venture capital firm, which opened locations at the University of Central Florida and NeoCity in Osceola County.","date":null,"source":null,"url":"https://news.orlando.org/blog/orlando-tech-employment-hits-74000/"},{"id":7,"title":null,"summary":"I cannot extract a news story from the provided HTML as it appears to contain an error message rather than actual content. The message \"Request unsuccessful. Incapsula incident ID: 1705000340320357852-468150490482935952\" indicates that the request to access the content was blocked or failed, possibly due to security measures implemented by Incapsula (a web application security service).\n\nThis error message suggests that either:\n1. The original request was blocked by security systems\n2. There was an authentication issue\n3. The server encountered a problem processing the request\n\nThere is no news story to summarize in this error message.","date":null,"source":null,"url":"https://www.bizjournals.com/orlando/news/technology"},{"id":8,"title":null,"summary":"# UF Study Could Help Hearing-Impaired Detect Audio Deepfakes\n\nUniversity of Florida researchers have developed a new method that could ultimately help hearing-impaired individuals detect fraudulent audio deepfakes.\n\nThe technology news story, featured on the UF website, highlights how this research could address a critical vulnerability for people with hearing impairments who may be unable to detect subtle anomalies in manipulated audio.\n\nThe study is particularly timely as audio deepfakes become increasingly sophisticated and potentially dangerous, especially for vulnerable populations. The UF research team's work aims to create tools that can identify artificially generated or manipulated voice recordings, providing an important safeguard against scams and misinformation targeting those with hearing disabilities.\n\nThis development is part of UF's expanding work in artificial intelligence applications, which includes various initiatives across the university's academic departments.","date":null,"source":null,"url":"https://www.ufl.edu/"},{"id":9,"title":null,"summary":"# Google Unveils 'AI Mode' for Search Engine\n\nGoogle has officially launched 'AI Mode' for its search engine, marking the next phase in the company's journey to transform how users search for information online. \n\nThe announcement was made by Alphabet CEO Sundar Pichai during a Google I/O event in Mountain View, California on Tuesday. This feature represents a significant evolution in Google's search capabilities, allowing users to fully engage with artificial intelligence when seeking information.\n\nThe new AI Mode is part of Google's broader strategy to integrate advanced AI technology into its core search product. While specific details about how AI Mode works weren't included in the announcement, it signals Google's commitment to maintaining its position as the leading search engine while embracing AI innovations.\n\nThis development comes amid increasing competition in the AI space, with rivals like Microsoft incorporating AI capabilities into their own search products. Google's move is likely aimed at ensuring its search engine remains relevant as user expectations around AI-powered information retrieval continue to evolve.\n\nThe company hasn't specified when AI Mode will be available to all users or what geographic limitations might apply to the rollout.","date":null,"source":null,"url":"https://www.clickorlando.com/tech/"},{"id":10,"title":null,"summary":"# Tetra Tech Releases White Paper on Liquid-Cooled AI Data Centers\n\nTetra Tech has published a new white paper addressing the challenges and innovations in designing liquid-cooled AI data centers. The paper focuses on sustainable solutions for the growing demands of artificial intelligence infrastructure.\n\nIn related news, the company is leveraging advanced analytical tools such as FusionMap® to improve grid reliability and restoration. This technology helps develop comprehensive secondary circuit models that enhance power systems.\n\nThe innovations come as part of Tetra Tech's broader digital solutions suite, Tetra Tech Delta, which incorporates advanced data analytics and artificial intelligence to create transformational solutions for clients across various sectors.","date":null,"source":null,"url":"https://www.tetratech.com/"}]