[{"link":"https://mynews13.com/fl/orlando/news/technology","title":"Technology News | Orlando Florida Local News | Spectrum News 13","summary":"I don't see a specific technology news story in the provided HTML. The content appears to be a website navigation structure for a Spectrum News site in Orlando, Florida, with various categories and menu items including a \"Technology\" section, but no actual technology news article content is visible in the HTML you shared.\n\nThe HTML shows the structure of the Spectrum News website with sections for news, weather, traffic, politics, space, sports, and other categories, but it doesn't contain the text of any particular technology news story that could be summarized."},{"link":"https://orlandotechnews.com/","title":"Orlando Tech News: Home","summary":"# Full Sail, Epic Games Bring Inaugural Unreal Game Jam to Orlando\n\nFull Sail University has partnered with Epic Games to host the first-ever \"Unreal Game Jam\" in Orlando, marking a significant milestone for Central Florida's tech community. \n\nThe event will bring game developers together in a competitive environment where participants will use Epic's Unreal Engine to create games within a limited timeframe. This collaboration highlights Orlando's growing reputation as a hub for game development and technology innovation.\n\nThe game jam adds to the region's already vibrant tech scene, which includes numerous hackathons and development events throughout the year. Full Sail University, known for its strong game development and entertainment technology programs, continues to strengthen industry partnerships to provide opportunities for both students and the broader Orlando tech community.\n\nThis announcement comes as Orlando's gaming sector continues to expand, with other recent gaming-related developments including a new VR experience downtown created by a Star Wars game veteran and various initiatives supporting the local video game industry."},{"link":"https://www.fit.edu/","title":"Florida Tech: www.fit.edu","summary":"# Student Experiment on Radiation Shielding Technology Selected for ISS Testing\n\nFlorida Tech students have developed an experiment on radiation shielding technology that has been selected for testing on the International Space Station. The project aims to evaluate new methods for protecting astronauts from harmful radiation in space. This selection marks a significant achievement for the university's space research program and provides students with real-world experience in developing space technology. The experiment will contribute to advancing safety measures for future space missions by testing innovative shielding materials in the actual space environment."},{"link":"https://www.ucf.edu/","title":"University of Central Florida | A University for the Future","summary":"# UCF Researchers Creating Technology Advancements for Space Exploration and Beyond\n\nUCF researchers are making significant technological breakthroughs that impact space exploration and various technical fields. Dr. Peter Delfyett is developing faster and more efficient lasers that have potential applications across multiple technologies.\n\nMeanwhile, UCF researcher Jillian Gloria has been working on finding water on the moon, research critical for determining where future astronauts can live and work safely during lunar missions.\n\nThe university is also advancing the field of quantum physics under researcher Enrique Del Barco, who is developing quantum technologies expected to power future innovations.\n\nThese developments are part of UCF's broader focus on space technologies, simulation, immersive experiences, healthcare, and national security research. The university, ranked in the top 5 for innovation among public universities, continues to strengthen its position as a leader in technological advancement through its faculty expertise and research initiatives."},{"link":"https://www.bizjournals.com/orlando/news/technology","title":"Orlando Technology News - Orlando Business Journal","summary":"I don't see an actual technology news story in the HTML you provided. What you've shared appears to be an error message from Incapsula (a web security service), indicating that a request was unsuccessful. The message includes an incident ID: 1705000340319631838-521413410712782993.\n\nThis is not a news article but rather an error page that you likely encountered when trying to access a website. There's no technology news content to extract or summarize.\n\nIf you'd like to read and summarize a technology news story, you might want to try accessing a different URL or sharing the complete content of an actual news article."},{"link":"https://www.ucf.edu/news/science-technology/","title":"Science & Technology News | University of Central Florida News","summary":"# UCF's 'Bridge Doctor' Uses Advanced Technology to Evaluate Concrete Bridges\n\nEngineering Professor Necati Catbas and former student Marwan Debees have developed an innovative approach to assess the safety of concrete bridges more efficiently. Their method combines infrared thermography, high-definition imaging, and neural network analysis to rapidly evaluate bridge integrity.\n\nThe technology allows for quick assessment of bridge structures without requiring extensive manual inspections. By utilizing this advanced imaging and AI analysis, engineers can identify potential structural issues earlier and more accurately.\n\nThis collaboration between UCF researchers and industry partners represents a significant advancement in infrastructure safety technology, particularly important as aging bridges across the country require more frequent and thorough evaluations."},{"link":"https://news.orlando.org/blog/orlando-tech-employment-hits-74000/","title":"Orlando Tech Employment Hits 74,000","summary":"# Orlando Tech Employment Hits 74,000\n\nOrlando's technology workforce grew to 74,000 in 2023, marking a 2.8% increase from the previous year. This growth rate ranks as the second highest among the 30 most populous regions in the United States, surpassing tech hubs like Austin (2.4%) and more than doubling the national average of 1.2%.\n\nThe Orlando tech workforce has expanded by 15% since 2018, adding 9,500 jobs over the five-year period. Tech employment in the region is projected to exceed 76,000 in 2024.\n\nNearly half of Orlando's tech employees (46,896) work for technology companies, while a similar number (45,641) work in tech occupations across various industries. Software development dominates the sector, accounting for 51.4% of tech industry employment and 35.6% of tech occupations.\n\nTech jobs in Orlando continue to offer substantial economic benefits, with median salaries more than double the region's overall median wage. However, demographic disparities persist, with women holding just 28% of tech positions and Hispanic and Black workers significantly underrepresented at 16% and 11% respectively.\n\nThe region's tech ecosystem received a boost in 2024 with the arrival of Plug and Play, a major startup accelerator and venture capital firm, establishing locations at the University of Central Florida and NeoCity in Osceola County."},{"link":"https://floridahightech.com/","title":"Florida High Tech Corridor | Unleashing the Region's Expotential","summary":"# USF and Florida High Tech Corridor Partner to Support Innovation Advancements\n\nThe University of South Florida and the Florida High Tech Corridor have announced a partnership to advance innovations in several key technology areas. The collaboration will provide $100,000 in funding to support projects focused on AI literacy, bilingual educator training, immersive learning experiences, and social and emotional learning curriculum.\n\nThis initiative is part of the Florida High Tech Corridor's broader mission to foster innovation across its 23-county region spanning from Florida's Suncoast to Space Coast. The Corridor leverages the resources of three major research institutions: the University of Central Florida, the University of South Florida, and the University of Florida.\n\nThe partnership aims to strengthen the region's position as a hub for technological advancement and workforce development in high-tech industries."},{"link":"https://www.clickorlando.com/tech/","title":"Tech News","summary":"# Google Launches AI Mode for Search Engine\n\nGoogle has unveiled \"AI Mode,\" the next phase of its ambitious plan to transform its search engine. Announced during a Google I/O event in Mountain View, California, this feature will allow users to switch the search engine into a full artificial intelligence experience.\n\nThe new AI Mode represents a significant evolution in Google's search capabilities, building on the company's ongoing efforts to integrate artificial intelligence more deeply into its core products. \n\nCEO Sundar Pichai presented the update during the event, highlighting how this AI-powered search experience will differ from traditional Google search results. While specific details about the functionality weren't included in the report, this development positions Google to compete more directly with other AI-driven search alternatives that have emerged in recent years.\n\nThis launch comes as major tech companies continue to invest heavily in AI technology, with search being one of the most critical battlegrounds for these innovations."},{"link":"https://www.ufl.edu/","title":"University of Florida: Home","summary":"# UF Study Could Help Hearing-Impaired Detect Audio Deepfake Fraud\n\nUniversity of Florida researchers have developed a new study that could ultimately help hearing-impaired individuals detect fraudulent audio deepfakes. \n\nThe research addresses a growing concern as audio deepfake technology becomes more sophisticated, posing particular risks to those with hearing impairments who may have difficulty distinguishing between real and artificially generated voices.\n\nThe UF team's work focuses on creating detection methods specifically designed to help those who rely on assistive hearing technologies identify manipulated audio that could be used in scams or misinformation campaigns.\n\nThis development comes as part of UF's broader research portfolio in artificial intelligence applications, with the university working to address both the technological challenges and accessibility concerns surrounding deepfake detection.\n\nThe study represents an important step toward protecting vulnerable populations from emerging digital threats as audio manipulation technologies continue to advance."}]