[{"id":1,"title":null,"summary":"# Apple Unveils New AI Features at Developers Conference\n\nApple has officially unveiled its new artificial intelligence features at its annual developers conference. The tech giant introduced \"Apple Intelligence,\" a suite of AI tools that will enhance Siri and be integrated across Apple devices including iPhones, iPads, and Macs.\n\nThe AI system will allow users to perform complex tasks like summarizing emails, creating custom emoji, and editing photos through natural language commands. Apple emphasized that these features will prioritize user privacy, with most processing happening directly on devices rather than in the cloud.\n\nIndustry analysts note this move represents Apple's response to competing AI offerings from Microsoft, Google, and OpenAI. The features are expected to roll out gradually through upcoming software updates later this year.","date":null,"source":null,"url":"https://mynews13.com/fl/orlando/news/technology"},{"id":2,"title":null,"summary":"# Student Experiment on Radiation Shielding Technology Selected for ISS Testing\n\nFlorida Tech students have developed an experimental radiation shielding technology that has been selected for testing aboard the International Space Station (ISS). The project is part of the university's ongoing research initiatives in space technology and represents a significant achievement for the student team.\n\nThe experiment aims to evaluate new radiation protection methods that could be crucial for future space missions. This selection highlights Florida Tech's strong position in aerospace research and provides students with real-world experience in developing space-ready technology.\n\nThis accomplishment comes as Florida Tech continues its legacy of contributing to space exploration, building on its historical roots in educating pioneers of the U.S. space program.","date":null,"source":null,"url":"https://www.fit.edu/"},{"id":3,"title":null,"summary":"# Full Sail, Epic Games Bring Inaugural Unreal Game Jam to Orlando\n\nFull Sail University has partnered with Epic Games to host the first-ever \"Unreal Game Jam\" in Orlando, marking a significant milestone for Central Florida's tech scene. The event will bring game developers together to create games using Epic's Unreal Engine technology in a competitive, time-limited format.\n\nThe game jam represents the growing importance of Orlando in the gaming industry ecosystem and strengthens the connection between educational institutions and industry leaders. Full Sail University, known for its game development programs, continues to position itself as a hub for gaming talent and innovation in the region.\n\nThis announcement comes as Orlando's gaming sector continues to expand, with other recent developments including a new VR experience coming to downtown Orlando led by a Star Wars video game veteran, and various initiatives to build the local video game community.\n\nThe inaugural Unreal Game Jam is scheduled to take place in 2025, according to the announcement published May 20, 2025 in Orlando Tech News.","date":null,"source":null,"url":"https://orlandotechnews.com/"},{"id":4,"title":null,"summary":"# UCF Researchers Pushing Boundaries in Laser Technology and Space Exploration\n\nUniversity of Central Florida researcher Dr. Peter Delfyett is making significant strides in improving laser technology, developing methods to make lasers faster and more efficient for future technological applications.\n\nMeanwhile, UCF graduate Jillian Gloria ('22) is conducting groundbreaking research to locate water on the moon, critical knowledge that will help determine where astronauts can safely live and work during future lunar missions.\n\nThe university is also advancing quantum physics research under scientist Enrique Del Barco, who is working on quantum systems that will power next-generation technologies.\n\nThese projects represent UCF's commitment to innovation, which has earned the university a top 5 ranking for innovation among public universities according to U.S. News & World Report. With faculty expertise spanning from space technologies to healthcare and national security, UCF continues to build its reputation as \"Florida's Most Innovative University.\"","date":null,"source":null,"url":"https://www.ucf.edu/"},{"id":5,"title":null,"summary":"# USF and Florida High Tech Corridor Partner to Boost Educational Innovation\n\nThe University of South Florida (USF) and the Florida High Tech Corridor have announced a partnership to advance educational innovations through $100,000 in funding. The initiative will support four key areas of educational technology development: AI literacy, bilingual educator training, immersive learning experiences, and social and emotional learning curriculum.\n\nThis partnership is part of the Florida High Tech Corridor's broader mission to foster innovation across its 23-county region, which is anchored by three major research institutions: the University of Central Florida, the University of South Florida, and the University of Florida.\n\nThe collaboration aims to strengthen the region's innovation ecosystem by connecting academic resources with industry needs, furthering the Corridor's goal of cultivating high-tech talent and supporting technology development throughout Central Florida.","date":null,"source":null,"url":"https://floridahightech.com/"},{"id":6,"title":null,"summary":"# Orlando Tech Employment Hits 74,000, Growing at Second-Fastest Rate Among Major U.S. Metros\n\nOrlando's technology workforce reached approximately 74,000 employees in 2023, adding 2,000 jobs from the previous year and 9,500 jobs over the past five years, according to new data from CompTIA's annual State of the Tech Workforce report.\n\nThe Orlando region's tech employment grew by 2.8% in 2023, ranking as the second-highest growth rate among the nation's 30 most populous metropolitan areas, trailing only Dallas. This growth rate surpassed tech hubs like Austin (2.4%), as well as Florida peers Miami (2.3%) and Tampa (1.5%), and more than doubled the national average of 1.2%.\n\nOrlando's tech workforce is nearly evenly split between those working in technology occupations (45,641) and those employed by tech companies (46,896), with about 40% overlap between these groups. Software dominates the local tech industry, accounting for over half (51.4%) of tech company employees and the largest share (35.6%) of tech occupation workers.\n\nTech workers in Orlando earn a substantial wage premium, with median salaries more than double the regional median across all occupations. However, the sector faces diversity challenges with women holding just 28% of tech jobs, while Hispanic and Black workers represent only 16% and 11% of the tech workforce respectively.\n\nThe Orlando Economic Partnership identifies growing tech employment among underrepresented groups as a key opportunity to advance economic prosperity in the region. Tech employment in Orlando is projected to exceed 76,000 in 2024.","date":null,"source":null,"url":"https://news.orlando.org/blog/orlando-tech-employment-hits-74000/"},{"id":7,"title":null,"summary":"I'm unable to extract a news story from the provided HTML, as it appears to be an Incapsula error message rather than an actual article. The text \"Request unsuccessful. Incapsula incident ID: 1705000340320357852-144727753603221641\" indicates that the request to access the content was blocked or failed by Incapsula, which is a web security service.\n\nThis error message typically appears when:\n- The website's security system has blocked the request\n- There might be connection issues\n- The content might no longer be available\n- Access restrictions might be in place\n\nWithout the actual news content, I cannot provide a summary of any technology news story.","date":null,"source":null,"url":"https://www.bizjournals.com/orlando/news/technology"},{"id":8,"title":null,"summary":"# UF Study Could Help Hearing-Impaired Detect Audio Deepfake Fraud\n\nUniversity of Florida researchers have developed a new method that could ultimately help hearing-impaired individuals detect fraudulent audio deepfakes. The study, highlighted on the UF engineering website, addresses a growing concern as audio deepfake technology becomes more sophisticated and poses increasing risks for vulnerable populations.\n\nWith voice cloning technology becoming more accessible, people with hearing impairments face particular challenges in identifying fake audio that might sound convincing to others. The UF research team's work represents an important step toward creating tools that can protect against voice-based scams that target those who rely on alternative ways to process audio communications.\n\nThis development comes amid rising concerns about AI-generated content and its potential for misuse in fraud schemes, particularly against vulnerable populations who may have difficulty distinguishing between authentic and artificially generated voices.","date":null,"source":null,"url":"https://www.ufl.edu/"},{"id":9,"title":null,"summary":"# Google Unveils 'AI Mode' as Part of Search Engine Transformation\n\nGoogle has launched a new \"AI Mode\" for its search engine, marking the next phase in the company's efforts to reimagine how people search for information online.\n\nAnnounced by Alphabet CEO Sundar Pichai at a Google I/O event in Mountain View, California, this feature represents a significant step in Google's ongoing transformation of its core search product.\n\nThe new AI Mode allows users to fully engage with Google's artificial intelligence capabilities when conducting searches, moving beyond traditional keyword-based results to provide more conversational and comprehensive responses.\n\nThis development comes as Google continues to integrate AI more deeply into its services, competing with other tech companies in the rapidly evolving AI space. The feature appears to be part of Google's strategy to maintain its dominance in search while adapting to changing user expectations around AI-powered information retrieval.\n\nThe announcement was made on Tuesday, May 20, 2025, according to the news report from WKMG ClickOrlando.","date":null,"source":null,"url":"https://www.clickorlando.com/tech/"},{"id":10,"title":null,"summary":"# Tetra Tech Releases White Paper on Liquid-Cooled AI Data Centers\n\nTetra Tech has published a new white paper addressing the challenges and innovations in designing liquid-cooled data centers specifically for artificial intelligence (AI) applications. \n\nThe engineering and consulting firm is also leveraging AI in its own operations, using advanced analytical tools such as FusionMap® to develop comprehensive secondary circuit models that improve grid reliability and restoration capabilities.\n\nThese initiatives align with Tetra Tech's broader focus on sustainable technology solutions, as the company continues to expand its digital capabilities through its Tetra Tech Delta suite of solutions, which incorporates advanced data analytics and artificial intelligence to create transformational results for clients across various sectors.","date":null,"source":null,"url":"https://www.tetratech.com/"}]